chronoweb/src/main/resources/webroot/example/getEventsXML/SimpleEventQuery_sensor/EQGTGELTLE_value_uom.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleEventQuery</queryName>
			<params>
				<param>
					<name>EQ_value_CEL</name>
					<value xsi:type="xsd:double">26.0</value>
				</param>
				<param>
					<name>GT_value_CEL</name>
					<value xsi:type="xsd:double">25.0</value>
				</param>
				<param>
					<name>GE_value_FAH</name>
					<value xsi:type="xsd:double">0</value>
				</param>
				<param>
					<name>LT_value_KEL</name>
					<value xsi:type="xsd:double">525.0</value>
				</param>
				<param>
					<name>LE_value_FAH</name>
					<value xsi:type="xsd:double">100</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>